var citys = [{
    "lnglat": [112.204251, 31.03542],
    "name": "荆门市",
    "style": 1
}, {
    "lnglat": [114.890593, 30.396536],
    "name": "鄂州市",
    "style": 1
}, {
    "lnglat": [112.144146, 32.042426],
    "name": "襄阳市",
    "style": 1
}, {
    "lnglat": [111.290843, 30.702636],
    "name": "宜昌市",
    "style": 1
}, {
    "lnglat": [110.787916, 32.646907],
    "name": "十堰市",
    "style": 1
}, {
    "lnglat": [115.077048, 30.220074],
    "name": "黄石市",
    "style": 1
}, {
    "lnglat": [113.113556, 36.191112],
    "name": "长治市",
    "style": 1
}, {
    "lnglat": [112.590047, 35.090378],
    "name": "济源市",
    "style": 1
}, {
    "lnglat": [114.649653, 33.620357],
    "name": "周口市",
    "style": 1
}, {
    "lnglat": [114.075031, 32.123274],
    "name": "信阳市",
    "style": 1
}, {
    "lnglat": [115.650497, 34.437054],
    "name": "商丘市",
    "style": 1
}, {
    "lnglat": [112.540918, 32.999082],
    "name": "南阳市",
    "style": 1
}, {
    "lnglat": [111.194099, 34.777338],
    "name": "三门峡市",
    "style": 1
}, {
    "lnglat": [114.026405, 33.575855],
    "name": "漯河市",
    "style": 1
}, {
    "lnglat": [113.826063, 34.022956],
    "name": "许昌市",
    "style": 1
}, {
    "lnglat": [114.352482, 36.103442],
    "name": "安阳市",
    "style": 1
}, {
    "lnglat": [109.49081, 36.596537],
    "name": "延安市",
    "style": 1
}, {
    "lnglat": [112.434468, 34.663041],
    "name": "洛阳市",
    "style": 1
}, {
    "lnglat": [119.461208, 35.428588],
    "name": "日照市",
    "style": 1
}, {
    "lnglat": [122.116394, 37.509691],
    "name": "威海市",
    "style": 1
}, {
    "lnglat": [117.129063, 36.194968],
    "name": "泰安市",
    "style": 1
}, {
    "lnglat": [116.587245, 35.415393],
    "name": "济宁市",
    "style": 1
}, {
    "lnglat": [119.107078, 36.70925],
    "name": "潍坊市",
    "style": 1
}, {
    "lnglat": [121.391382, 37.539297],
    "name": "烟台市",
    "style": 1
}, {
    "lnglat": [106.376173, 39.01333],
    "name": "石嘴山市",
    "style": 1
}, {
    "lnglat": [118.66471, 37.434564],
    "name": "东营市",
    "style": 1
}, {
    "lnglat": [117.557964, 34.856424],
    "name": "枣庄市",
    "style": 1
}, {
    "lnglat": [112.736465, 37.696495],
    "name": "晋中市",
    "style": 1
}, {
    "lnglat": [117.971185, 28.44442],
    "name": "上饶市",
    "style": 1
}, {
    "lnglat": [116.358351, 27.98385],
    "name": "抚州市",
    "style": 1
}, {
    "lnglat": [114.391136, 27.8043],
    "name": "宜春市",
    "style": 1
}, {
    "lnglat": [106.285241, 36.004561],
    "name": "固原市",
    "style": 1
}, {
    "lnglat": [114.986373, 27.111699],
    "name": "吉安市",
    "style": 1
}, {
    "lnglat": [114.940278, 25.85097],
    "name": "赣州市",
    "style": 1
}, {
    "lnglat": [117.033838, 28.238638],
    "name": "鹰潭市",
    "style": 1
}, {
    "lnglat": [114.930835, 27.810834],
    "name": "新余市",
    "style": 1
}, {
    "lnglat": [115.992811, 29.712034],
    "name": "九江市",
    "style": 1
}, {
    "lnglat": [105.189568, 37.514951],
    "name": "中卫市",
    "style": 1
}, {
    "lnglat": [113.852186, 27.622946],
    "name": "萍乡市",
    "style": 1
}, {
    "lnglat": [117.214664, 29.29256],
    "name": "景德镇市",
    "style": 1
}, {
    "lnglat": [111.003957, 35.022778],
    "name": "运城市",
    "style": 1
}, {
    "lnglat": [118.178459, 26.635627],
    "name": "南平市",
    "style": 1
}, {
    "lnglat": [117.661801, 24.510897],
    "name": "漳州市",
    "style": 1
}, {
    "lnglat": [118.589421, 24.908853],
    "name": "泉州市",
    "style": 1
}, {
    "lnglat": [117.635001, 26.265444],
    "name": "三明市",
    "style": 1
}, {
    "lnglat": [119.007558, 25.431011],
    "name": "莆田市",
    "style": 1
}, {
    "lnglat": [118.11022, 24.490474],
    "name": "厦门市",
    "style": 1
}, {
    "lnglat": [117.000923, 36.675807],
    "name": "济南市",
    "style": 0
}, {
    "lnglat": [106.278179, 38.46637],
    "name": "银川市",
    "style": 0
}, {
    "lnglat": [113.665412, 34.757975],
    "name": "郑州市",
    "style": 0
}, {
    "lnglat": [114.298572, 30.584355],
    "name": "武汉市",
    "style": 0
}, {
    "lnglat": [125.3245, 43.886841],
    "name": "长春市",
    "style": 0
}, {
    "lnglat": [101.778916, 36.623178],
    "name": "西宁市",
    "style": 0
}, {
    "lnglat": [112.549248, 37.857014],
    "name": "太原市",
    "style": 0
}, {
    "lnglat": [113.280637, 23.125178],
    "name": "广州市",
    "style": 0
}, {
    "lnglat": [108.320004, 22.82402],
    "name": "南宁市",
    "style": 0
}, {
    "lnglat": [106.504962, 29.533155],
    "name": "重庆市",
    "style": 0
}, {
    "lnglat": [104.065735, 30.659462],
    "name": "成都市",
    "style": 0
}, {
    "lnglat": [113.54909, 22.198951],
    "name": "澳门",
    "style": 0
}, {
    "lnglat": [103.823557, 36.058039],
    "name": "兰州市",
    "style": 0
}, {
    "lnglat": [106.713478, 26.578343],
    "name": "贵阳市",
    "style": 0
}, {
    "lnglat": [102.712251, 25.040609],
    "name": "昆明市",
    "style": 0
}, {
    "lnglat": [91.132212, 29.660361],
    "name": "拉萨市",
    "style": 0
}, {
    "lnglat": [108.948024, 34.263161],
    "name": "西安市",
    "style": 0
}, {
    "lnglat": [114.502461, 38.045474],
    "name": "石家庄市",
    "style": 0
}, {
    "lnglat": [117.190182, 39.125596],
    "name": "天津市",
    "style": 0
}, {
    "lnglat": [116.405285, 39.904989],
    "name": "北京市",
    "style": 0
}]
